wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
/* ssh_server.c
 *
 * Copyright (C) 2014-2024 wolfSSL Inc.
 *
 * This file is part of wolfSSH.
 *
 * wolfSSH is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfSSH is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with wolfSSH.  If not, see <http://www.gnu.org/licenses/>.
 */

/* wolfSSL */
/* Important: make sure settings.h appears before any other wolfSSL headers */
#include <wolfssl/wolfcrypt/settings.h>
#ifndef WOLFSSL_USER_SETTINGS
    #error "WOLFSSL_USER_SETTINGS should have been defined in project cmake"
#endif
#include <wolfssl/wolfcrypt/port/Espressif/esp32-crypt.h>
#include <wolfssl/wolfcrypt/types.h>
#include <wolfssl/wolfcrypt/logging.h>
#ifndef WOLFSSL_ESPIDF
    #error "Problem with wolfSSL user_settings."
    #error "Check [project]/components/wolfssl/include"
#endif

/* wolfSSL */
#include <wolfssl/ssl.h>
#include <wolfssl/wolfcrypt/ecc.h>
#include <wolfssl/wolfcrypt/logging.h>
#include <wolfssl/wolfcrypt/coding.h>
#include <wolfssl/wolfcrypt/sha256.h>

/* wolfSSH */
#include <wolfssh/ssh.h>
#include <wolfssh/test.h>

/* Espressif */
#include <esp_log.h>

/* Project */
#include "ssh_server_config.h"
#include "ssh_server.h"
#include "tx_rx_buffer.h"


/* note our actual buffer is used by RTOS threads, and eventually interrupts */
static volatile byte sshStreamTransmitBufferArray[EXT_TX_BUF_MAX_SZ];
static volatile byte sshStreamReceiveBufferArray[EXT_RX_BUF_MAX_SZ];

static const char* TAG = "ssh_server";

static const char samplePasswordBuffer[] =
    "jill:upthehill\n"
    "jack:fetchapail\n";


static const char samplePublicKeyEccBuffer[] =
    "ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAA"
    "BBBNkI5JTP6D0lF42tbxX19cE87hztUS6FSDoGvPfiU0CgeNSbI+aFdKIzTP5CQEJSvm25"
    "qUzgDtH7oyaQROUnNvk= hansel\n"
    "ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAA"
    "BBBKAtH8cqaDbtJFjtviLobHBmjCtG56DMkP6A4M2H9zX2/YCg1h9bYS7WHd9UQDwXO1Hh"
    "IZzRYecXh7SG9P4GhRY= gretel\n"
    "ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAA"
    "BBBIuaGC8Y+GsIwhuw3tGbqqp+KtuyCewgFfU/prGo29G1EonNdFkWGsB9383pOLlwJqTG"
    "UpQ/8B0KfWZKbv8bpcM= gojimmypi@DESKTOP\n";


static const char samplePublicKeyRsaBuffer[] =
    "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC9P3ZFowOsONXHD5MwWiCciXytBRZGho"
    "MNiisWSgUs5HdHcACuHYPi2W6Z1PBFmBWT9odOrGRjoZXJfDDoPi+j8SSfDGsc/hsCmc3G"
    "p2yEhUZUEkDhtOXyqjns1ickC9Gh4u80aSVtwHRnJZh9xPhSq5tLOhId4eP61s+a5pwjTj"
    "nEhBaIPUJO2C/M0pFnnbZxKgJlX7t1Doy7h5eXxviymOIvaCZKU+x5OopfzM/wFkey0EPW"
    "NmzI5y/+pzU5afsdeEWdiQDIQc80H6Pz8fsoFPvYSG+s4/wz0duu7yeeV1Ypoho65Zr+pE"
    "nIf7dO0B8EblgWt+ud+JI8wrAhfE4x hansel\n"
    "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCqDwRVTRVk/wjPhoo66+Mztrc31KsxDZ"
    "+kAV0139PHQ+wsueNpba6jNn5o6mUTEOrxrz0LMsDJOBM7CmG0983kF4gRIihECpQ0rcjO"
    "P6BSfbVTE9mfIK5IsUiZGd8SoE9kSV2pJ2FvZeBQENoAxEFk0zZL9tchPS+OCUGbK4SDjz"
    "uNZl/30Mczs73N3MBzi6J1oPo7sFlqzB6ecBjK2Kpjus4Y1rYFphJnUxtKvB0s+hoaadru"
    "biE57dK6BrH5iZwVLTQKux31uCJLPhiktI3iLbdlGZEctJkTasfVSsUizwVIyRjhVKmbdI"
    "RGwkU38D043AR1h0mUoGCPIKuqcFMf gretel\n";

/* #define SSH_SERVER_PROFILE */

#ifdef SSH_SERVER_PROFILE
    static int MaxSeenRxSize = 0;
    static int MaxSeenTxSize = 0;
#endif

/* Show HW lockdepth. Oddities here are often a symptom of stack overflow. */
#if !defined(NO_WOLFSSL_ESP32_CRYPT_HASH) && \
     defined(WOLFSSL_ESP32_HW_LOCK_DEBUG)
    #define SSH_SERVER_DEBUG_LOCKDEPTH
#endif
/* Map user names to passwords */
/* Use arrays for username and p. The password or public key can
 * be hashed and the hash stored here. Then I won't need the type. */
typedef struct PwMap {
    byte type;
    byte username[32];
    word32 usernameSz;
    byte p[WC_SHA256_DIGEST_SIZE];
    struct PwMap* next;
} PwMap;


typedef struct PwMapList {
    PwMap* head;
} PwMapList;


typedef struct {
    WOLFSSH* ssh;
    int fd;
    word32 id;
    char nonBlock;
} thread_ctx_t;


/* find a byte character [str] of length [bufSz] within [buf];
 * returns byte position if found, otherwise zero
 */
static byte find_char(const byte* str, const byte* buf, word32 bufSz)
{
    int ret = 0;
    const byte* cur;
    while (bufSz && (ret == 0) && (ret < 255)) {
        cur = str;
        while (*cur != '\0') {
            if (*cur == *buf) {
                ret = *cur;
            }
            cur++;
        }
        buf++;
        bufSz--;
    }
    if (ret == 255) {
        ESP_LOGE(TAG, "find_char not found in 254 chars");
    }

    return ret;
}


static int dump_stats(thread_ctx_t* ctx)
{
    ESP_LOGE(TAG,"dumpstats");
    char stats[1024];
    word32 statsSz;
    word32 txCount, rxCount, seq, peerSeq;

    wolfSSH_GetStats(ctx->ssh, &txCount, &rxCount, &seq, &peerSeq);

    WSNPRINTF(stats,
        sizeof(stats),
        "Statistics for Thread #%u:\r\n"
        "  txCount = %u\r\n  rxCount = %u\r\n"
        "  seq = %u\r\n  peerSeq = %u\r\n",
        ctx->id,
        txCount,
        rxCount,
        seq,
        peerSeq);
    statsSz = (word32)strlen(stats);

    fprintf(stderr, "%s", stats);
    return wolfSSH_stream_send(ctx->ssh, (byte*)stats, statsSz);
}

static int NonBlockSSH_accept(WOLFSSH* ssh)
{
    int ret;
    int error;
    int sockfd;
    int select_ret = 0;
    int max_wait = 100;
    ESP_LOGI(TAG,"Start NonBlockSSH_accept");

    ret = wolfSSH_accept(ssh);
    error = wolfSSH_get_error(ssh);
    sockfd = (int)wolfSSH_get_fd(ssh);

    while (ret != WS_SUCCESS &&
            (error == WS_WANT_READ || error == WS_WANT_WRITE)) {

        max_wait--;
        if (max_wait < 0) {
            error = WS_FATAL_ERROR;
        }
#if (0)
        /* Some optional debugging verbosity: */
        if (error == WS_WANT_READ)
            ESP_LOGE(TAG,"... client would read block\n");
        else if (error == WS_WANT_WRITE)
            ESP_LOGE(TAG,"... client would write block\n");
#endif
        select_ret = tcp_select(sockfd, 1);
        if (select_ret == WS_SELECT_RECV_READY  ||
            select_ret == WS_SELECT_ERROR_READY ||
            error == WS_WANT_WRITE) {
            ret = wolfSSH_accept(ssh);
            error = wolfSSH_get_error(ssh);
        }
        else if (select_ret == WS_SELECT_TIMEOUT)
            error = WS_WANT_READ;
        else
            error = WS_FATAL_ERROR;

        /* RTOS yield */
        vTaskDelay(100 / portTICK_PERIOD_MS);
        #ifdef SSH_SERVER_WDT_RESET
        {
            esp_task_wdt_reset();
        }
        #endif
    }
    ESP_LOGI(TAG,"Exit NonBlockSSH_accept");

    return ret;
}


