wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
/*
 * server_worker is the main thread for a given SSH connection
 */
static THREAD_RETURN WOLFSSH_THREAD server_worker(void* vArgs)
{
    int ret;

    /* we'll create a local instance of threadCtx since it will be
     * handed off to potentially multiple separate threads
     */
    thread_ctx_t* threadCtx = (thread_ctx_t*)vArgs;

#if defined(WOLFSSH_SCP) && defined(NO_FILESYSTEM)
    ScpBuffer scpBufferRecv, scpBufferSend;
    byte fileBuffer[49000];
    byte fileTmp[] = "wolfSSH SCP buffer file";

    WMEMSET(&scpBufferRecv, 0, sizeof(ScpBuffer));
    scpBufferRecv.buffer   = fileBuffer;
    scpBufferRecv.bufferSz = sizeof(fileBuffer);
    wolfSSH_SetScpRecvCtx(threadCtx->ssh, (void*)&scpBufferRecv);

    /* make buffer file to send if asked */
    WMEMSET(&scpBufferSend, 0, sizeof(ScpBuffer));
    WMEMCPY(scpBufferSend.name, "test.txt", sizeof("test.txt"));
    scpBufferSend.nameSz   = WSTRLEN("test.txt");
    scpBufferSend.buffer   = fileTmp;
    scpBufferSend.bufferSz = sizeof(fileBuffer);
    scpBufferSend.fileSz   = sizeof(fileTmp);
    scpBufferSend.mode     = 0x1A4;
    wolfSSH_SetScpSendCtx(threadCtx->ssh, (void*)&scpBufferSend);
#endif

    if (!threadCtx->nonBlock)
        ret = wolfSSH_accept(threadCtx->ssh);
    else
        ret = NonBlockSSH_accept(threadCtx->ssh);

    if (ret == WS_SUCCESS) {
        byte* this_rx_buf = NULL;

        int backlogSz = 0, rxSz, txSz, stop = 0, txSum;

        init_tx_rx_buffer(TXD_PIN, RXD_PIN);

        /*
         * we'll stay in this loop then entire time this worker thread has
         * a valid SSH connection open
         */
        do {
            /* int show_msg = 0;
             * TODO optionally disable echo of text to USB port */
            int has_err = 0;
            this_rx_buf = (byte*)&sshStreamReceiveBufferArray;
            vTaskDelay(10);

            if (!stop) {
                do {
                    int error = 0;
                    socklen_t len = sizeof(error);
                    int retval = getsockopt(threadCtx->fd,
                                           SOL_SOCKET, SO_ERROR, &error, &len);

                    if (retval != 0) {
                        /* if we can't even call getsockopt, give up */
                        stop = 1;
                        ESP_LOGE(TAG,"ERROR: getsockopt "
                                     "unable to query socket fd!");
                    }
                    if (error != 0) {
                        /* socket has a non zero error status */
                        ESP_LOGE(TAG,"ERROR: getsockopt "
                                     "returned error socket fd!");
                        stop = 1;
                    }

                    /* when polling, debugging can be verbose, turn it off */
                    #ifdef DEBUG_WOLFSSH
                        ESP_LOGV(TAG, "wolfSSH debugging off.");
                        wolfSSH_Debugging_OFF();
                    #endif

                    /* this is a blocking call, awaiting an SSH keypress
                     * unless nonBlock = 1 (normally we are NOT blocking) */
                    rxSz = wolfSSH_stream_read(threadCtx->ssh,
                                               this_rx_buf + backlogSz,
                                               EXAMPLE_BUFFER_SZ);

                    if (rxSz <= 0) {
                        rxSz = wolfSSH_get_error(threadCtx->ssh);
                        if (rxSz == WS_WANT_READ || rxSz == WS_WANT_WRITE)
                        {
                            /* WS_WANT_READ or WS_WANT_WRITE but no data yet */
                            rxSz = 0;
                        }
                        else
                        {
                            /*  any other negative value is an error */
                            has_err = 1;
                            ESP_LOGE(TAG, "wolfSSH_stream_read error!");
                        }
                    }
                    else {
#if defined(DISABLE_SSH_UART)
                        this_rx_buf[rxSz] = 0;
                        rxSz = 0;
                        /* printf is not ideal for embedded, but here for demo
                         * output only. setvbuf should have been set to flush
                         * output immediately:*/
                        printf("%s", this_rx_buf);
#else
                        ESP_LOGI(TAG, "Received %d bytes from client.", rxSz);
#endif
                    }


                    /* turn debugging back on */
                    #ifdef DEBUG_WOLFSSH
                        ESP_LOGV(TAG, "wolfSSH debugging on.");
                        wolfSSH_Debugging_ON();
                    #endif

                    taskYIELD();
                    #ifdef SSH_SERVER_WDT_RESET
                    {
                        esp_task_wdt_reset();
                    }
                    #endif

                } while ((WOLFSSL_NONBLOCK == 0) /* We'll wait only when
                                                  * not using non-blocking
                                                  * socket. */
                         &&
                         (rxSz == WS_WANT_READ || rxSz == WS_WANT_WRITE));

                /*
                 * if there's data in the external transmit buffer, typically
                 * from UART, we'll send that to the SSH client.
                 */
                if (ExternalTransmitBufferSz() > 0) {
                    ESP_LOGI(TAG,"Tx UART!");

                    /* our actual transit buffer array is not on the local
                     * stack to minimize RTOS requirements; we'll setup a
                     * pointer to it.
                     *
                     * Note this is a *different* buffer from the
                     * external (UART) which may change during RTOS threads,
                     * and future interrupt code.
                     * */
                    byte* sshStreamTransmitBuffer =
                          (byte*)(&sshStreamTransmitBufferArray);

