wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
                    /* We'll get a copy of the buffer and
                     * set _ExternalTransmitBufferSz to zero
                     *
                     * Note this is thread safe, getting both data and size.
                     */
                    int thisSize = Get_ExternalTransmitBuffer(
                                       &sshStreamTransmitBuffer
                                   );

                    if (sshStreamTransmitBuffer == NULL) {
                        /* TODO this is an error as the buffer should never
                         * be null if the size was larger than zero */
                        stop = 1;
                    }
                    else {
                        /* note thisSize will not have changed from any other
                         *  thread, since we have a copy and fixed size */
                        wolfSSH_stream_send(threadCtx->ssh,
                                            sshStreamTransmitBuffer,
                                            thisSize);
                    }
                } /* ExternalTransmitBufferSz() > 0 */

                /*
                 * If we received any data from the SSH client,
                 * we'll store it in the External Received Buffer
                 * for later sending to the UART.
                 *
                 * Reminder negative values for WS_WANT_READ || WS_WANT_WRITE
                 */
                if (rxSz > 0) {
                    /* Append external data, for something such as
                     * UART forwarding.
                     *
                     * Note any prior data saved in the buffer
                     * was _ExternalReceiveBufferSz.
                     *
                     * Here we perform the thread-safe equivalent of:
                     *
                        memcpy(
                            &_ExternalReceiveBuffer[_ExternalReceiveBufferSz],
                            buf,
                            rxSz);
                        _ExternalReceiveBufferSz = rxSz;
                     */
                    Set_ExternalReceiveBuffer(this_rx_buf, rxSz);

                    backlogSz += rxSz;
                    txSum = 0;
                    txSz = 0;

                    while (backlogSz != txSum && txSz >= 0 && !stop) {
                        /* we typically do NOT want to re-echo TTY data
                         * but it can be configured to do so by setting
                         * SSH_SERVER_ECHO to a value of 1
                         **/
                        if (SSH_SERVER_ECHO == 1) {
                            /* reminder we moved data from external buffer
                             * to our local buf, and this is ECHO
                             */
                            txSz = wolfSSH_stream_send(threadCtx->ssh,
                                                       this_rx_buf + txSum,
                                                       backlogSz - txSum);
                        }
                        else {
                            txSz = backlogSz - txSum;
                        }

                        if (txSz > 0) {
                            byte c;
                            const byte matches[] = { 0x03, 0x05, 0x06, 0x00 };

                            c = find_char(matches, this_rx_buf + txSum, txSz);

                            switch (c) {

                            case 0x03:
                                stop = 1;
                                break;

                            case 0x06:
                                if (wolfSSH_TriggerKeyExchange(threadCtx->ssh)
                                        != WS_SUCCESS) {
                                    stop = 1;
                                }
                                break;

                            case 0x05:
                                if (dump_stats(threadCtx) <= 0) {
                                    stop = 1;
                                }
                                break;
                            }

                            txSum += txSz;
                        }
                        else if (txSz != WS_REKEYING) {
                            stop = 1;
                        }

                        taskYIELD();
                        #ifdef SSH_SERVER_WDT_RESET
                        {
                            esp_task_wdt_reset();
                        }
                        #endif
                    } /* while */

                    if (txSum < backlogSz) {
                        memmove(this_rx_buf,
                                this_rx_buf + txSum,
                                backlogSz - txSum);
                    }
                    backlogSz -= txSum;
                }
                else {
                    /* we might have negative values for non-blocking Rx
                     * during WS_WANT_READ || WS_WANT_WRITE */
                    if (has_err == 1)
                    {
                        stop = 1;
                    }
                }
            }

        #ifdef DEBUG_WDT
            /* if we get panic faults, perhaps the watchdog needs attention? */
            taskYIELD();
            vTaskDelay(pdMS_TO_TICKS(10));
            esp_task_wdt_reset();
        #endif
        } while (!stop);
    } /* if (ret == WS_SUCCESS) */

    else if (ret == WS_SCP_COMPLETE) {
        ESP_LOGE(TAG,"scp file transfer completed\n");
#if defined(WOLFSSH_SCP) && defined(NO_FILESYSTEM)
        ESP_LOGE(TAG,"scp");
        if (scpBufferRecv.fileSz > 0) {
            word32 z;

            printf("file name : %s\n", scpBufferRecv.name);
            printf("     size : %d\n", scpBufferRecv.fileSz);
            printf("     mode : %o\n", scpBufferRecv.mode);
            printf("    mTime : %lu\n", scpBufferRecv.mTime);
            printf("\n");

            for (z = 0; z < scpBufferRecv.fileSz; z++)
                printf("%c", scpBufferRecv.buffer[z]);
            printf("\n");
        }
#endif
    } /* else if (ret == WS_SCP_COMPLETE) */
    else if (ret == WS_SFTP_COMPLETE) {
        ESP_LOGE(TAG,"Use example/echoserver/echoserver for SFTP\n");
    }

