wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
    wolfSSH_stream_exit(threadCtx->ssh, 0);

    /* check if open before closing */
    if (threadCtx->fd != SOCKET_INVALID) {
        ESP_LOGI(TAG,"Close sockfd socket");
        close(threadCtx->fd);
    }

    wolfSSH_free(threadCtx->ssh);
    free(threadCtx);

    return 0;
}

#ifndef NO_FILESYSTEM
static int load_file(const char* fileName, byte* buf, word32 bufSz)
{
    FILE* file;
    word32 fileSz;
    word32 readSz;

    if (fileName == NULL) return 0;

    if (WFOPEN(&file, fileName, "rb") != 0)
        return 0;
    fseek(file, 0, SEEK_END);
    fileSz = (word32)ftell(file);
    rewind(file);

    if (fileSz > bufSz) {
        fclose(file);
        return 0;
    }

    readSz = (word32)fread(buf, 1, fileSz, file);
    if (readSz < fileSz) {
        fclose(file);
        return 0;
    }

    fclose(file);

    return fileSz;
}
#endif /* !NO_FILESYSTEM */



/* returns buffer size on success */
static int load_key(byte isEcc, byte* buf, word32 bufSz)
{
    word32 sz = 0;

#ifndef NO_FILESYSTEM
    const char* bufName;
    bufName = isEcc ? "./keys/server-key-ecc.der" :
                       "./keys/server-key-rsa.der";
    sz = load_file(bufName, buf, bufSz);
#else
    /* using buffers instead */
    if (isEcc) {
        if ((word32)sizeof_ecc_key_der_256 > bufSz) {
            return 0;
        }
    #ifdef DEMO_SERVER_384
        WMEMCPY(buf, ecc_key_der_384, sizeof_ecc_key_der_384);
        sz = sizeof_ecc_key_der_384;
    #else
        WMEMCPY(buf, ecc_key_der_256, sizeof_ecc_key_der_256);
        sz = sizeof_ecc_key_der_256;
    #endif

    }
    else {
        if ((word32)sizeof_rsa_key_der_2048 > bufSz) {
            return 0;
        }
        WMEMCPY(buf, rsa_key_der_2048, sizeof_rsa_key_der_2048);
        sz = sizeof_rsa_key_der_2048;
    }
#endif

    return sz;
}


/* our own little c word32 to array */
static WC_INLINE void c32toa(word32 u32, byte* c)
{
    c[0] = (u32 >> 24) & 0xff;
    c[1] = (u32 >> 16) & 0xff;
    c[2] = (u32 >>  8) & 0xff;
    c[3] =  u32 & 0xff;
}

static PwMap* PwMapNew(PwMapList* list,
                       byte type,
                       const byte* username,
                       word32 usernameSz,
                       const byte* p,
                       word32 pSz) {
    PwMap* map = NULL;

    map = (PwMap*)malloc(sizeof(PwMap));
    if (map != NULL) {
        wc_Sha256 sha = { };
        byte flatSz[4];
        int fsz = 0;

        map->type = type;
        if (usernameSz >= sizeof(map->username))
            usernameSz = sizeof(map->username) - 1;
        memcpy(map->username, username, usernameSz + 1);
        map->username[usernameSz] = 0;
        map->usernameSz = usernameSz;

        ESP_LOGI(TAG, "map->username = %s", map->username);

        wc_InitSha256(&sha);
        c32toa(pSz, flatSz);

        fsz = sizeof(flatSz);

    #ifdef DEBUG_WOLFSSH
        ESP_LOGI(TAG, "map->username = %s", map->username);
        ESP_LOGI(TAG, "SHA256 flatSz: 0x%02x%02x%02x%02x; size = %d",
                      flatSz[0], flatSz[1], flatSz[2], flatSz[3], fsz);
        ESP_LOGI(TAG, "SHA256 sample password: '%s': size = %d bytes", p, pSz);
    #endif
    #if defined(SSH_SERVER_DEBUG_LOCKDEPTH)
        ESP_LOGW(TAG, "PwMapNew sha256 final ctx->lockDepth = %d",
                       (&sha.ctx)->lockDepth);
        ESP_LOGW(TAG, "calling wc_Sha256Update(1) ctx->lockDepth = %d",
                       (&sha.ctx)->lockDepth);
    #endif
        wc_Sha256Update((wc_Sha256*)&sha, flatSz, fsz);
    #if defined(SSH_SERVER_DEBUG_LOCKDEPTH) && \
       !defined(NO_WOLFSSL_ESP32_CRYPT_HASH_SHA256)
        ESP_LOGW(TAG, "calling wc_Sha256Update(2) ctx->lockDepth = %d",
                      (&sha.ctx)->lockDepth);
    #endif
        wc_Sha256Update((wc_Sha256*)&sha, p, pSz);
    #if defined(SSH_SERVER_DEBUG_LOCKDEPTH) && \
       !defined(NO_WOLFSSL_ESP32_CRYPT_HASH_SHA256)

        ESP_LOGW(TAG, "calling wc_Sha256Final ctx->lockDepth = %d",
                      (&sha.ctx)->lockDepth);
    #endif
        wc_Sha256Final((wc_Sha256*)&sha, (byte*)map->p);

        map->next = list->head;
        list->head = map;
    }

    return map;
}

static void PwMapListDelete(PwMapList* list)
{
    if (list != NULL) {
        PwMap* head = list->head;

        while (head != NULL) {
            PwMap* cur = head;
            head = head->next;
            memset(cur, 0, sizeof(PwMap));
            free(cur);
        }
    }
}

static int LoadPasswordBuffer(byte* buf, word32 bufSz, PwMapList* list)
{
    char* str = (char*)buf;
    char* delimiter;
    char* username;
    char* password;

    /* Each line of passwd.txt is in the format
     *     username:password\n
     * This function modifies the passed-in buffer. */

    if (list == NULL)
        return -1;

    if (buf == NULL || bufSz == 0) {
        ESP_LOGW(TAG, "Warning: LoadPasswordBuffer size is zero!");
        return 0;
    }

    while (*str != 0) {
        delimiter = strchr(str, ':');
        if (delimiter == NULL) {
            return -1;
        }
        username = str;
        *delimiter = 0;
        password = delimiter + 1;
        str = strchr(password, '\n');
        if (str == NULL) {
            return -1;
        }
        *str = 0;
        str++;
        if (PwMapNew(list,
                     WOLFSSH_USERAUTH_PASSWORD,
                     (byte*)username,
                     (word32)strlen(username),
                     (byte*)password,
                     (word32)strlen(password)) == NULL) {

            return -1;
        }
    }

    return 0;
}


static int LoadPublicKeyBuffer(byte* buf, word32 bufSz, PwMapList* list)
{
    char* str = (char*)buf;
    char* delimiter;
    byte* publicKey64;
    word32 publicKey64Sz;
    byte* username;
    word32 usernameSz;
    byte  publicKey[300];
    word32 publicKeySz;

    /* Each line of passwd.txt is in the format
     *     ssh-rsa AAAB3BASE64ENCODEDPUBLICKEYBLOB username\n
     * This function modifies the passed-in buffer. */
    if (list == NULL)
        return -1;

    if (buf == NULL || bufSz == 0) {
        ESP_LOGW(TAG, "Warning: LoadPublicKeyBuffer buffer size is zero!");
        return 0;
    }

    while (*str != 0) {
        /* Skip the public key type. This example will always be ssh-rsa. */
        delimiter = strchr(str, ' ');
        if (delimiter == NULL) {
            return -1;
        }
        str = delimiter + 1;
        delimiter = strchr(str, ' ');
        if (delimiter == NULL) {
            return -1;
        }
        publicKey64 = (byte*)str;
        *delimiter = 0;
        publicKey64Sz = (word32)(delimiter - str);
        str = delimiter + 1;
        delimiter = strchr(str, '\n');
        if (delimiter == NULL) {
            return -1;
        }
        username = (byte*)str;
        *delimiter = 0;
        usernameSz = (word32)(delimiter - str);
        str = delimiter + 1;
        publicKeySz = sizeof(publicKey);

        if (Base64_Decode(publicKey64,
            publicKey64Sz,
            publicKey,
            &publicKeySz) != 0) {

            return -1;
        }

