wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
    /*
    ***************************************************************************
    * set SO_REUSEADDR on socket
    *
    *  #include <sys/types.h>
    *  # include <sys / socket.h>
    *  int getsockopt(int sockfd,
    *    int level,
    *    int optname,
    *    void *optval,
    *    socklen_t *optlen); int setsockopt(int sockfd,
    *    int level,
    *    int optname,
    *    const void *optval,
    *    socklen_t optlen);
    *
    *  setsockopt() manipulates options for the socket referred to by the file
    *  descriptor sockfd. Options may exist at multiple protocol levels; they
    *  are always present at the uppermost socket level.
    *
    *  When manipulating socket options, the level at which the option resides
    *  and the name of the option must be specified. To manipulate options at
    *  the sockets API level, level is specified as SOL_SOCKET. To manipulate
    *  options at any other level the protocol number of the appropriate
    *  protocol controlling the option is supplied. For example, to indicate
    *  that an option is to be interpreted by the TCP protocol, level should
    *  be set to the protocol number of TCP
    *
    *  Return Value
    *    On success, zero is returned. On error, -1 is returned, and errno is
    *    set appropriately.
    *
    *  Errors
    *    EBADF       The argument sockfd is not a valid descriptor.
    *    EFAULT      The address pointed to by optval is not in a valid part
    *                of the process address space. For getsockopt(), this error
    *                may also be returned if optlen is not in a valid part of
    *                the process address space.
    *    EINVAL      optlen invalid in setsockopt(). In some cases this error
    *                can also occur for an invalid value in optval
    *                (e.g. for IP_ADD_MEMBERSHIP option described in ip(7)).
    *    ENOPROTOOPT The option is unknown at the level indicated.
    *    ENOTSOCK    The argument sockfd is a file, not a socket.
    *
    *  see: https://linux.die.net/man/2/setsockopt
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /* make sure server is setup for reuse addr/port */
        int soc_ret;

        on = 1;
        soc_ret = setsockopt(sockfd,
                             SOL_SOCKET,
                             SO_REUSEADDR,
                             (char*)&on,
                             (socklen_t)sizeof(on)
                            );

        if (soc_ret == 0) {
            ESP_LOGI(TAG,"setsockopt re-use addr successful");
        }
        else {
            /* TODO show errno */
            ret = WOLFSSL_FAILURE;
            ESP_LOGE(TAG,"\r\nERROR: failed to setsockopt addr on socket.\n");
        }
    }
    else {
        ESP_LOGE(TAG,"Skipping setsockopt addr\n");
    }

#ifdef SO_REUSEPORT
    /* see above for details on getsockopt  */
    if (ret == WOLFSSL_SUCCESS) {
        int soc_ret = setsockopt(sockfd,
            SOL_SOCKET,
            SO_REUSEPORT,
            (char*)&on,
            (socklen_t)sizeof(on));

        if (soc_ret == 0) {
            ESP_LOGI(TAG,"setsockopt re-use port successful\n");
        }
        else {
            ESP_LOGE(TAG,"\r\nERROR: failed to setsockopt port on socket." \
                         "  >> IGNORED << \n");
        }
    }
    else {
        ESP_LOGE(TAG,"Skipping setsockopt port\n");
    }
#else
    ESP_LOGI(TAG,"SO_REUSEPORT not configured for setsockopt to re-use port\n");
#endif

    /*
    ***************************************************************************
    *  #include <sys/types.h>
    *  #include <sys/socket.h>
    *
    *  int bind(int sockfd,
    *      const struct sockaddr *addr,
    *      socklen_t addrlen);
    *
    *  Description
    *
    *  When a socket is created with socket(2), it exists in a name
    *  space(address family) but has no address assigned to it.
    *
    *  bind() assigns the address specified by addr to the socket referred to
    *  by the file descriptor sockfd.addrlen specifies the size, in bytes, of
    *  the address structure pointed to by addr.Traditionally, this operation
    *  is called "assigning a name to a socket".
    *
    *   It is normally necessary to assign a local address using bind() before
    *   a SOCK_STREAM socket may receive connections.
    *
    *  Return Value
    *    On success, zero is returned.
    *    On error, -1 is returned, and errno is set appropriately.
    *
    *  Errors
    *    EACCES     The address is protected, and the user is not the superuser.
    *    EADDRINUSE The given address is already in use.
    *    EBADF      sockfd is not a valid descriptor.
    *    EINVAL     The socket is already bound to an address.
    *    ENOTSOCK   sockfd is a descriptor for a file, not a socket.
    *
    *   see: https://linux.die.net/man/2/bind
    *
    *       https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/lwip.html
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /* Bind the server socket to our port */
        int soc_ret = bind(sockfd,
                           (struct sockaddr*)&servAddr,
                                       sizeof(servAddr)
                          );

        if (soc_ret > -1) {
            ESP_LOGI(TAG,"socket bind successful.");
        }
        else {
            ret = WOLFSSL_FAILURE;
            ESP_LOGE(TAG,"\r\nERROR: failed to bind to socket.\n");
        }
    }

    /*
    ***************************************************************************
    *  Listen for a new connection, allow 5 pending connections
    *
    *  #include <sys/types.h>
    *  #include <sys/socket.h>
    *  int listen(int sockfd, int backlog);
    *
    *  Description
    *
    *  listen() marks the socket referred to by sockfd as a passive socket,
    *  that is, as a socket that will be used to accept incoming connection
    *  requests using accept.
    *
    *  The sockfd argument is a file descriptor that refers to a socket of
    *  type SOCK_STREAM or SOCK_SEQPACKET.
    *
    *  The backlog argument defines the maximum length to which the queue of
    *  pending connections for sockfd may grow.If a connection request arrives
    *  when the queue is full, the client may receive an error with an
    *  indication of ECONNREFUSED or, if the underlying protocol supports
    *  retransmission, the request may be ignored so that a later reattempt
    *  at connection succeeds.
    *
    *   Return Value
    *     On success, zero is returned.
    *     On Error, -1 is returned, and errno is set appropriately.
    *   Errors
    *     EADDRINUSE   Another socket is already listening on the same port.
    *     EBADF        The argument sockfd is not a valid descriptor.
    *     ENOTSOCK     The argument sockfd is not a socket.
    *     EOPNOTSUPP   The socket is not of a type that supports
    *                  the listen() operation.
    *
    *  see: https://linux.die.net/man/2/listen
    */

    if (ret == WOLFSSL_SUCCESS) {
        int backlog = 5;
        int soc_ret = listen(sockfd, backlog);
        if (soc_ret > -1) {
            ESP_LOGI(TAG,"socket listen successful\n");
        }
        else {
           ret = WOLFSSL_FAILURE;
           ESP_LOGE(TAG,"\r\nERROR: failed to listen to socket.\n");
        }
    }

#ifdef NO_RSA
    /* If wolfCrypt isn't built with RSA, force ECC on. */
    useEcc = 1;
    ESP_LOGI(TAG,"Found NO_RSA, setting useEcc = 1");
#endif

    if (wolfSSH_Init() != WS_SUCCESS) {
        ESP_LOGE(TAG,"Couldn't initialize wolfSSH.\n");
        exit(EXIT_FAILURE);
    }

    ctx = wolfSSH_CTX_new(WOLFSSH_ENDPOINT_SERVER, NULL);
    if (ctx == NULL) {
        ESP_LOGE(TAG,"Couldn't allocate SSH CTX data.\n");
        exit(EXIT_FAILURE);
    }


    memset(&pwMapList, 0, sizeof(pwMapList));

