wolfSSL/wolfssh-examples/Espressif/ESP32/ESP32-SSH-Server/main/ssh_server.c
    /* authorization is a callback, so assign it here: wsUserAuth */
    wolfSSH_SetUserAuth(ctx, wsUserAuth);

    /* set the login banner message as defined in ssh_server_config.h */
    wolfSSH_CTX_SetBanner(ctx, SSH_SERVER_BANNER);

    {
        const char* bufName;
        byte buf[SCRATCH_BUFFER_SZ];
        word32 bufSz;
        int ret = 0;

        bufSz = load_key(useEcc, buf, SCRATCH_BUFFER_SZ);
        if (bufSz == 0) {
            ESP_LOGE(TAG, "Couldn't load key.\n");
            exit(EXIT_FAILURE);
        }
        if (wolfSSH_CTX_UsePrivateKey_buffer(ctx,
                                             buf,
                                             bufSz,
                                             WOLFSSH_FORMAT_ASN1) < 0) {
            ESP_LOGE(TAG,"Couldn't use key buffer.\n");
            exit(EXIT_FAILURE);
        }

        bufSz = (word32)strlen(samplePasswordBuffer);
        memcpy(buf, samplePasswordBuffer, bufSz);
        buf[bufSz] = 0;
        ret = LoadPasswordBuffer(buf, bufSz, &pwMapList);
        if (ret != 0) {
            ESP_LOGE(TAG, "Error: failed LoadPasswordBuffer %d", ret);
            exit(EXIT_FAILURE);
        }

        bufName = useEcc ? samplePublicKeyEccBuffer :
                           samplePublicKeyRsaBuffer;
        bufSz = (word32)strlen(bufName);
        memcpy(buf, bufName, bufSz);
        buf[bufSz] = 0;
        LoadPublicKeyBuffer(buf, bufSz, &pwMapList);
        if (ret != 0) {
            ESP_LOGE(TAG, "Error: failed LoadPasswordBuffer %d", ret);
            exit(EXIT_FAILURE);
        }
    }

    listen(sockfd, 5);

    do {
        int      clientFd = 0;
        struct sockaddr_in clientAddr;
        socklen_t     clientAddrSz = sizeof(clientAddr);
#ifndef SINGLE_THREADED
        THREAD_TYPE   thread;
        ESP_LOGI(TAG,"Did not find SINGLE_THREADED defined");
#endif
        WOLFSSH*      ssh;

        /* We'll create a new instance of threadCtx since it will be
         * handed off to potentially multiple separate threads.
         */
        thread_ctx_t* threadCtx;

        threadCtx = (thread_ctx_t*)malloc(sizeof(thread_ctx_t));
        if (threadCtx == NULL) {
            ESP_LOGE(TAG,"Couldn't allocate thread context data.\n");
            exit(EXIT_FAILURE);
        }

        /*
         * optionally register some callbacks (these are not working)
        wolfSSH_SetIORecv(ctx, my_IORecv);
        wolfSSH_SetIOSend(ctx, my_IOSend);
         */

        ssh = wolfSSH_new(ctx);
        if (ssh == NULL) {
            ESP_LOGE(TAG,"Failed to create ssh object during wolfSSH_new.\n");
            exit(EXIT_FAILURE);
        }
        wolfSSH_SetUserAuthCtx(ssh, &pwMapList);
        /* Use the session object for its own highwater callback ctx */
        if (defaultHighwater > 0) {
            wolfSSH_SetHighwaterCtx(ssh, (void*)ssh);
            wolfSSH_SetHighwater(ssh, defaultHighwater);
        }

        clientFd = accept(sockfd,
                          (struct sockaddr*)&clientAddr,
                          &clientAddrSz
                         );

        if (clientFd == -1) {
            ESP_LOGI(TAG,"ERROR: failed accept");
            exit(EXIT_FAILURE);
        }

        if (WOLFSSL_NONBLOCK)
            tcp_set_nonblocking(&clientFd);

        wolfSSH_set_fd(ssh, (int)clientFd);

        threadCtx->ssh = ssh;
        threadCtx->fd = clientFd;
        threadCtx->id = threadCount++;
        threadCtx->nonBlock = WOLFSSL_NONBLOCK;

        ESP_LOGI(TAG,"server_worker started.");
#ifndef SINGLE_THREADED
    #ifdef WOLFSSH_TEST_THREADING
        ThreadStart(server_worker, threadCtx, &thread);

        if (multipleConnections)
            ThreadDetach(thread);
        else
            ThreadJoin(thread);
    #else
        /* see "wolfssh/test.h" check user_settings.h */
        #error "WOLFSSH_TEST_THREADING must be enabled unless SINGLE_THREADED"
    #endif
#else
        server_worker(threadCtx);
#endif /* SINGLE_THREADED */
        ESP_LOGI(TAG,"server_worker completed.");
        vTaskDelay(10);
    } while (multipleConnections);
    ESP_LOGI(TAG,"all servers exited.");

    PwMapListDelete(&pwMapList);
    wolfSSH_CTX_free(ctx);
    if (wolfSSH_Cleanup() != WS_SUCCESS) {
        ESP_LOGE(TAG,"Couldn't clean up wolfSSH.\n");
        exit(EXIT_FAILURE);
    }
#if defined(HAVE_ECC) && defined(FP_ECC) && defined(HAVE_THREAD_LS)
    wc_ecc_fp_free(); /* free per thread cache */
#endif

    ESP_LOGI(TAG,"server test done!");

    /* Cleanup and return */

    if (mConnd != SOCKET_INVALID) {
        ESP_LOGI(TAG,"Close mConnd socket");
        close(mConnd); /* Close the connection to the client   */
        mConnd = SOCKET_INVALID;
    }
    if (sockfd != SOCKET_INVALID) {
        ESP_LOGI(TAG,"Close sockfd socket");
        close(sockfd); /* Close the socket listening for clients   */
        sockfd = SOCKET_INVALID;
    }

    return;
}
